vault backup: 2026-06-25 23:01:19: remove ascii, add mermaid to design pattern
